GreatCowBASIC/DATFileGenerator/incfiles/p18f57k42.inc
;----- DMA2SPTRH Bits -----------------------------------------------------
SPTR8            EQU  H'0000'
SPTR9            EQU  H'0001'
SPTR10           EQU  H'0002'
SPTR11           EQU  H'0003'
SPTR12           EQU  H'0004'
SPTR13           EQU  H'0005'
SPTR14           EQU  H'0006'
SPTR15           EQU  H'0007'


DMA2SPTR8        EQU  H'0000'
DMA2SPTR9        EQU  H'0001'
DMA2SPTR10       EQU  H'0002'
DMA2SPTR11       EQU  H'0003'
DMA2SPTR12       EQU  H'0004'
DMA2SPTR13       EQU  H'0005'
DMA2SPTR14       EQU  H'0006'
DMA2SPTR15       EQU  H'0007'


;----- DMA2SPTRU Bits -----------------------------------------------------
SPTR16           EQU  H'0000'
SPTR17           EQU  H'0001'
SPTR18           EQU  H'0002'
SPTR19           EQU  H'0003'
SPTR20           EQU  H'0004'
SPTR21           EQU  H'0005'


DMA2SPTR16       EQU  H'0000'
DMA2SPTR17       EQU  H'0001'
DMA2SPTR18       EQU  H'0002'
DMA2SPTR19       EQU  H'0003'
DMA2SPTR20       EQU  H'0004'
DMA2SPTR21       EQU  H'0005'


;----- DMA2SSZL Bits -----------------------------------------------------
SSZ0             EQU  H'0000'
SSZ1             EQU  H'0001'
SSZ2             EQU  H'0002'
SSZ3             EQU  H'0003'
SSZ4             EQU  H'0004'
SSZ5             EQU  H'0005'
SSZ6             EQU  H'0006'
SSZ7             EQU  H'0007'

DMA2SSZ0         EQU  H'0000'
DMA2SSZ1         EQU  H'0001'
DMA2SSZ2         EQU  H'0002'
DMA2SSZ3         EQU  H'0003'
DMA2SSZ4         EQU  H'0004'
DMA2SSZ5         EQU  H'0005'
DMA2SSZ6         EQU  H'0006'
DMA2SSZ7         EQU  H'0007'


;----- DMA2SSZH Bits -----------------------------------------------------
SSZ8             EQU  H'0000'
SSZ9             EQU  H'0001'
SSZ10            EQU  H'0002'
SSZ11            EQU  H'0003'

DMA2SSZ8         EQU  H'0000'
DMA2SSZ9         EQU  H'0001'
DMA2SSZ10        EQU  H'0002'
DMA2SSZ11        EQU  H'0003'


;----- DMA2SSAL Bits -----------------------------------------------------
SSA0             EQU  H'0000'
SSA1             EQU  H'0001'
SSA2             EQU  H'0002'
SSA3             EQU  H'0003'
SSA4             EQU  H'0004'
SSA5             EQU  H'0005'
SSA6             EQU  H'0006'
SSA7             EQU  H'0007'


DMA2SSA0         EQU  H'0000'
DMA2SSA1         EQU  H'0001'
DMA2SSA2         EQU  H'0002'
DMA2SSA3         EQU  H'0003'
DMA2SSA4         EQU  H'0004'
DMA2SSA5         EQU  H'0005'
DMA2SSA6         EQU  H'0006'
DMA2SSA7         EQU  H'0007'


;----- DMA2SSAH Bits -----------------------------------------------------
SSA8             EQU  H'0000'
SSA9             EQU  H'0001'
SSA10            EQU  H'0002'
SSA11            EQU  H'0003'
SSA12            EQU  H'0004'
SSA13            EQU  H'0005'
SSA14            EQU  H'0006'
SSA15            EQU  H'0007'


DMA2SSA8         EQU  H'0000'
DMA2SSA9         EQU  H'0001'
DMA2SSA10        EQU  H'0002'
DMA2SSA11        EQU  H'0003'
DMA2SSA12        EQU  H'0004'
DMA2SSA13        EQU  H'0005'
DMA2SSA14        EQU  H'0006'
DMA2SSA15        EQU  H'0007'


;----- DMA2SSAU Bits -----------------------------------------------------
SSA16            EQU  H'0000'
SSA17            EQU  H'0001'
SSA18            EQU  H'0002'
SSA19            EQU  H'0003'
SSA20            EQU  H'0004'
SSA21            EQU  H'0005'


DMA2SSA16        EQU  H'0000'
DMA2SSA17        EQU  H'0001'
DMA2SSA18        EQU  H'0002'
DMA2SSA19        EQU  H'0003'
DMA2SSA20        EQU  H'0004'
DMA2SSA21        EQU  H'0005'


;----- DMA2CON0 Bits -----------------------------------------------------
XIP              EQU  H'0000'
AIRQEN           EQU  H'0002'
DGO              EQU  H'0005'
SIRQEN           EQU  H'0006'
EN               EQU  H'0007'

DMA2XIP          EQU  H'0000'
DMA2AIRQEN       EQU  H'0002'
DMA2DGO          EQU  H'0005'
DMA2SIRQEN       EQU  H'0006'
DMA2EN           EQU  H'0007'


;----- DMA2CON1 Bits -----------------------------------------------------
SSTP             EQU  H'0000'
DSTP             EQU  H'0005'


;----- DMA2AIRQ Bits -----------------------------------------------------
AIRQ0            EQU  H'0000'
AIRQ1            EQU  H'0001'
AIRQ2            EQU  H'0002'
AIRQ3            EQU  H'0003'
AIRQ4            EQU  H'0004'
AIRQ5            EQU  H'0005'
AIRQ6            EQU  H'0006'

DMA2AIRQ0        EQU  H'0000'
DMA2AIRQ1        EQU  H'0001'
DMA2AIRQ2        EQU  H'0002'
DMA2AIRQ3        EQU  H'0003'
DMA2AIRQ4        EQU  H'0004'
DMA2AIRQ5        EQU  H'0005'
DMA2AIRQ6        EQU  H'0006'


;----- DMA2SIRQ Bits -----------------------------------------------------
SIRQ0            EQU  H'0000'
SIRQ1            EQU  H'0001'
SIRQ2            EQU  H'0002'
SIRQ3            EQU  H'0003'
SIRQ4            EQU  H'0004'
SIRQ5            EQU  H'0005'
SIRQ6            EQU  H'0006'

DMA2SIRQ0        EQU  H'0000'
DMA2SIRQ1        EQU  H'0001'
DMA2SIRQ2        EQU  H'0002'
DMA2SIRQ3        EQU  H'0003'
DMA2SIRQ4        EQU  H'0004'
DMA2SIRQ5        EQU  H'0005'
DMA2SIRQ6        EQU  H'0006'


;----- CLC4CON Bits -----------------------------------------------------
INTN_CLC4CON     EQU  H'0003'
INTP_CLC4CON     EQU  H'0004'
OUT_CLC4CON      EQU  H'0005'
OE               EQU  H'0006'
EN               EQU  H'0007'

MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'

LC4INTN          EQU  H'0003'
LC4INTP          EQU  H'0004'
LC4OUT           EQU  H'0005'
LC4OE            EQU  H'0006'
LC4EN            EQU  H'0007'

LC4MODE0         EQU  H'0000'
LC4MODE1         EQU  H'0001'
LC4MODE2         EQU  H'0002'


;----- CLC4POL Bits -----------------------------------------------------
G1POL            EQU  H'0000'
G2POL            EQU  H'0001'
G3POL            EQU  H'0002'
G4POL            EQU  H'0003'
POL_CLC4POL      EQU  H'0007'

LC4G1POL         EQU  H'0000'
LC4G2POL         EQU  H'0001'
LC4G3POL         EQU  H'0002'
LC4G4POL         EQU  H'0003'
LC4POL           EQU  H'0007'


;----- CLC4SEL0 Bits -----------------------------------------------------
D1S0             EQU  H'0000'
D1S1             EQU  H'0001'
D1S2             EQU  H'0002'
D1S3             EQU  H'0003'
D1S4             EQU  H'0004'
D1S5             EQU  H'0005'
D1S6             EQU  H'0006'
D1S7             EQU  H'0007'

